app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE ("restaurants"."name" LIKE '%Bravo%' OR "restaurants"."description" LIKE '%Bravo%')
---
  def search
    @restaurants = Restaurant.search(
       name_or_description_cont: params[:q]
       ).result

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def set_restaurant
     @restaurant = Restaurant.find_by(id: params[:id])